import * as React from 'react';

export const About = () => {
    return (
        <div className="about-page-container">
            <div className="about-page">
                <h1 className="about-page-text" style={{textAlign: "justify", marginLeft: "100px", marginRight: "100px"}}>
                    HistMan — это интеллектуальная диалоговая система, созданная для подготовки учащихся к экзамену по истории Беларуси. 
Наша цель — сделать процесс обучения более увлекательным и эффективным, используя современные технологии и подходы.
Система HistMan отвечает на ключевые вопросы, такие как "Кто такой?", "Что такое?", "Что произошло?", а также помогает анализировать причины событий, подводить итоги и составлять краткие конспекты. Мы предоставляем учащимся возможность легко и быстро находить информацию, необходимую для успешной сдачи экзаменов.
Мы стремимся вдохновить учащихся на глубокое понимание своего исторического наследия и развить их критическое мышление. 
Присоединяйтесь к HistMan и откройте для себя увлекательный мир истории!
                </h1>
                <h1 className="about-page-text">
                    Разработано{' '}
                        <a href="https://sem.systems/" className="text">
                          Intelligent Semantic Systems LLC
                        </a>
                    , Все права защищены.{' '}
                </h1>
            </div>
        </div>
    );
}
